#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s
module.buckets.aws_s3_bucket_object.upload_file_s3_function_object: Refreshing state... [id=lambdas/demo/upload_file_s3_handler.zip]
module.buckets.aws_s3_bucket_object.get_company_investments_function_object: Refreshing state... [id=lambdas/demo/get_company_investments_handler.zip]
module.network.aws_apigatewayv2_api.websocket_api: Refreshing state... [id=9cd29nbvb8]
module.buckets.aws_s3_bucket_object.register_function_object: Refreshing state... [id=lambdas/demo/register.zip]
module.logs.aws_cloudwatch_log_group.get_company_permissions_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_company_permissions_lambda_function]
module.policy.aws_iam_policy.lambda_glue_access: Refreshing state... [id=arn:aws:iam::435552912911:policy/demo_iam_policy_lambda_glue_access]
module.policy.aws_iam_role.get_users_lambda_exec_role: Refreshing state... [id=demo_get_users_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.change_user_role_lambda_function: Refreshing state... [id=/aws/lambda/demo_change_user_role_lambda_function]
module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object: Refreshing state... [id=lambdas/demo/get_investment_date_report_handler.zip]
module.buckets.aws_s3_bucket_object.get_universe_overview_function_object: Refreshing state... [id=lambdas/demo/get_universe_overview_handler.zip]
module.logs.aws_cloudwatch_log_group.add_scenario_lambda_function: Refreshing state... [id=/aws/lambda/demo_add_scenario_lambda_function]
module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object: Refreshing state... [id=lambdas/demo/get_all_public_companies_handler.zip]
module.network.aws_api_gateway_rest_api.api: Refreshing state... [id=kb7gblbu69]
module.codebuild.aws_codebuild_source_credential.git_credential: Refreshing state... [id=arn:aws:codebuild:us-west-2:435552912911:token/github]
module.buckets.aws_s3_bucket_object.get_company_permissions_function_object: Refreshing state... [id=lambdas/demo/get_company_permissions_handler.zip]
module.buckets.aws_s3_bucket_object.get_investment_year_report_function_object: Refreshing state... [id=lambdas/demo/get_investment_year_report_handler.zip]
module.buckets.aws_s3_bucket_object.disconnect_function_object: Refreshing state... [id=lambdas/demo/disconnect.zip]
module.buckets.aws_s3_bucket_object.delete_company_function_object: Refreshing state... [id=lambdas/demo/delete_company_handler.zip]
module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object: Refreshing state... [id=lambdas/demo/get_company_report_vs_peers_handler.zip]
module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object: Refreshing state... [id=lambdas/demo/get_dynamic_report_handler.zip]
module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object: Refreshing state... [id=lambdas/demo/add_user_to_customer_group_handler.zip]
module.buckets.aws_s3_bucket_object.validate_data_function_object: Refreshing state... [id=lambdas/demo/validate_data_handler.zip]
module.buckets.aws_s3_bucket_object.get_investment_year_options_function_object: Refreshing state... [id=lambdas/demo/get_investment_year_options_handler.zip]
module.buckets.aws_s3_bucket_object.get_roles_function_object: Refreshing state... [id=lambdas/demo/get_roles_handler.zip]
module.buckets.aws_s3_bucket_object.get_all_companies_function_object: Refreshing state... [id=lambdas/demo/get_all_companies_handler.zip]
module.buckets.aws_s3_bucket_object.get_user_details_function_object: Refreshing state... [id=lambdas/demo/get_user_details_handler.zip]
module.buckets.aws_s3_bucket_object.connect_function_object: Refreshing state... [id=lambdas/demo/connect.zip]
module.buckets.aws_s3_bucket_object.get_company_details_function_object: Refreshing state... [id=lambdas/demo/get_company_details_handler.zip]
module.logs.aws_cloudwatch_log_group.change_company_publicly_lambda_function: Refreshing state... [id=/aws/lambda/demo_change_company_publicly_lambda_function]
module.logs.aws_cloudwatch_log_group.delete_scenarios_lambda_function: Refreshing state... [id=/aws/lambda/demo_delete_scenarios_lambda_function]
module.logs.aws_cloudwatch_log_group.authorize_lambda_function: Refreshing state... [id=/aws/lambda/demo_authorize_lambda_function]
module.logs.aws_cloudwatch_log_group.connect_lambda_function: Refreshing state... [id=/aws/lambda/demo_connect_lambda_function]
module.logs.aws_cloudwatch_log_group.get_universe_overview_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_universe_overview_lambda_function]
module.logs.aws_cloudwatch_log_group.delete_company_lambda_function: Refreshing state... [id=/aws/lambda/demo_delete_company_lambda_function]
module.logs.aws_cloudwatch_log_group.add_user_to_customer_group_lambda_function: Refreshing state... [id=/aws/lambda/demo_add_user_to_customer_group_lambda_function]
module.logs.aws_cloudwatch_log_group.disconnect_lambda_function: Refreshing state... [id=/aws/lambda/demo_disconnect_lambda_function]
module.logs.aws_cloudwatch_log_group.get_all_public_companies_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_all_public_companies_lambda_function]
module.logs.aws_cloudwatch_log_group.get_company_investments_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_company_investments_lambda_function]
module.logs.aws_cloudwatch_log_group.update_data_lambda_function: Refreshing state... [id=/aws/lambda/demo_update_data_lambda_function]
module.logs.aws_cloudwatch_log_group.get_company_report_vs_peers_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_company_report_vs_peers_lambda_function]
module.logs.aws_cloudwatch_log_group.download_comparison_vs_peers_lambda_function: Refreshing state... [id=/aws/lambda/demo_download_comparison_vs_peers_lambda_function]
module.buckets.aws_s3_bucket_object.change_user_role_function_object: Refreshing state... [id=lambdas/demo/change_user_role_handler.zip]
module.logs.aws_cloudwatch_log_group.get_edit_modify_data_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_edit_modify_data_lambda_function]
module.buckets.aws_s3_bucket_object.edit_modify_data_function_object: Refreshing state... [id=lambdas/demo/edit_modify_data_handler.zip]
module.logs.aws_cloudwatch_log_group.register_lambda_function: Refreshing state... [id=/aws/lambda/demo_register_lambda_function]
module.logs.aws_cloudwatch_log_group.assign_company_permissions_lambda_function: Refreshing state... [id=/aws/lambda/demo_assign_company_permissions_lambda_function]
module.logs.aws_cloudwatch_log_group.get_users_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_users_lambda_function]
module.logs.aws_cloudwatch_log_group.get_comparison_vs_peers_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_comparison_vs_peers_lambda_function]
module.logs.aws_cloudwatch_log_group.validate_data_lambda_function: Refreshing state... [id=/aws/lambda/demo_validate_data_lambda_function]
module.logs.aws_cloudwatch_log_group.glue_trigger_lambda_function: Refreshing state... [id=/aws/lambda/demo_glue_trigger_lambda_function]
module.logs.aws_cloudwatch_log_group.get_company_details_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_company_details_lambda_function]
module.logs.aws_cloudwatch_log_group.codebuild_rds_migrations: Refreshing state... [id=/aws/codebuild/demo_rds_migrations]
module.logs.aws_cloudwatch_log_group.get_dynamic_report_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_dynamic_report_lambda_function]
module.logs.aws_cloudwatch_log_group.get_all_companies_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_all_companies_lambda_function]
module.policy.aws_iam_role.change_company_publicly_lambda_exec_role: Refreshing state... [id=demo_change_company_publicly_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.get_by_metric_report_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_by_metric_report_lambda_function]
module.buckets.aws_s3_bucket_object.add_investment_function_object: Refreshing state... [id=lambdas/demo/add_investment_handler.zip]
module.buckets.aws_s3_bucket_object.message_function_object: Refreshing state... [id=lambdas/demo/message.zip]
module.buckets.aws_s3_bucket_object.layer_libraries_object: Refreshing state... [id=layer/demo/layer_libraries.zip]
module.buckets.aws_s3_bucket_object.glue_trigger_function_object: Refreshing state... [id=lambdas/demo/glue_trigger_handler.zip]
module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object: Refreshing state... [id=lambdas/demo/download_comparison_vs_peers_handler.zip]
module.buckets.aws_s3_bucket_object.update_data_function_object: Refreshing state... [id=lambdas/demo/update_data.zip]
module.policy.aws_iam_role.download_comparison_vs_peers_lambda_exec_role: Refreshing state... [id=demo_download_comparison_vs_peers_lambda_exec_role]
module.policy.aws_iam_role.disconnect_lambda_exec_role: Refreshing state... [id=demo_disconnect_lambda_exec_role]
module.buckets.aws_s3_bucket_object.add_scenario_function_object: Refreshing state... [id=lambdas/demo/add_scenario_handler.zip]
module.buckets.aws_s3_bucket_object.authorize_function_object: Refreshing state... [id=lambdas/demo/authorize_handler.zip]
module.policy.aws_iam_role.get_edit_modify_data_lambda_exec_role: Refreshing state... [id=demo_get_edit_modify_data_lambda_exec_role]
module.policy.aws_iam_role.message_lambda_exec_role: Refreshing state... [id=demo_message_lambda_exec_role]
module.buckets.aws_s3_bucket_object.get_users_function_object: Refreshing state... [id=lambdas/demo/get_users_handler.zip]
module.policy.aws_iam_role.company_investments_lambda_exec_role: Refreshing state... [id=demo_get_company_investments_lambda_exec_role]
module.policy.aws_iam_role.edit_modify_data_lambda_exec_role: Refreshing state... [id=demo_edit_modify_data_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.message_lambda_function: Refreshing state... [id=/aws/lambda/demo_message_lambda_function]
module.logs.aws_cloudwatch_log_group.get_metric_types_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_metric_types_lambda_function]
module.logs.aws_cloudwatch_log_group.upload_file_s3_lambda_function: Refreshing state... [id=/aws/lambda/demo_upload_file_s3_lambda_function]
module.policy.aws_iam_role.get_user_details_lambda_exec_role: Refreshing state... [id=demo_get_user_details_lambda_exec_role]
module.policy.aws_iam_role.delete_scenarios_lambda_exec_role: Refreshing state... [id=demo_delete_scenarios_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.get_user_details_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_user_details_lambda_function]
module.policy.aws_iam_role.add_scenario_lambda_exec_role: Refreshing state... [id=demo_add_scenario_lambda_exec_role]
module.policy.aws_iam_role.get_investment_year_options_lambda_exec_role: Refreshing state... [id=demo_get_investment_year_options_lambda_exec_role]
module.policy.aws_iam_role.get_company_report_vs_peers_lambda_exec_role: Refreshing state... [id=demo_get_company_report_vs_peers_lambda_exec_role]
module.policy.aws_iam_role.connect_lambda_exec_role: Refreshing state... [id=demo_connect_lambda_exec_role]
module.policy.aws_iam_role.get_dynamic_report_lambda_exec_role: Refreshing state... [id=demo_get_dynamic_report_lambda_exec_role]
module.policy.aws_iam_role.get_investment_year_report_lambda_exec_role: Refreshing state... [id=demo_get_investment_year_report_lambda_exec_role]
module.policy.aws_iam_role.get_company_details_lambda_exec_role: Refreshing state... [id=demo_get_company_details_lambda_exec_role]
module.policy.aws_iam_role.update_data_lambda_exec_role: Refreshing state... [id=demo_update_data_lambda_exec_role]
module.buckets.aws_s3_bucket_object.etl_script_object: Refreshing state... [id=pyspark/kpinetwork_analizer.py]
module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object: Refreshing state... [id=lambdas/demo/get_comparison_vs_peers_handler.zip]
module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object: Refreshing state... [id=lambdas/demo/assign_company_permissions_handler.zip]
module.policy.aws_iam_role.change_user_role_lambda_exec_role: Refreshing state... [id=demo_change_user_role_lambda_exec_role]
module.policy.aws_iam_role.assign_company_permissions_lambda_exec_role: Refreshing state... [id=demo_assign_company_permissions_lambda_exec_role]
module.policy.aws_iam_role.add_investment_lambda_exec_role: Refreshing state... [id=demo_add_investment_lambda_exec_role]
module.policy.aws_iam_role.verify_users_with_same_email_lambda_exec_role: Refreshing state... [id=demo_verify_users_with_same_email_exec_role]
module.buckets.aws_s3_bucket_object.delete_scenarios_function_object: Refreshing state... [id=lambdas/demo/delete_scenarios_handler.zip]
module.logs.aws_cloudwatch_log_group.get_investment_year_options_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_investment_year_options_lambda_function]
module.policy.aws_iam_role.companies_lambda_exec_role: Refreshing state... [id=demo_companies_lambda_exec_role]
module.policy.aws_iam_role.add_user_to_customer_group_lambda_exec_role: Refreshing state... [id=demo_add_user_to_customer_group_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.get_roles_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_roles_lambda_function]
module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object: Refreshing state... [id=lambdas/demo/verify_users_with_same_email_handler.zip]
module.buckets.aws_s3_bucket_object.get_metric_types_function_object: Refreshing state... [id=lambdas/demo/get_metric_types_handler.zip]
module.logs.aws_cloudwatch_log_group.get_investment_date_report_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_investment_date_report_lambda_function]
module.policy.aws_lambda_permission.apigw_authorize_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.logs.aws_cloudwatch_log_group.edit_modify_data_lambda_function: Refreshing state... [id=/aws/lambda/demo_edit_modify_data_lambda_function]
module.policy.aws_iam_role.get_investment_date_report_lambda_exec_role: Refreshing state... [id=demo_get_investment_date_report_lambda_exec_role]
module.policy.aws_iam_role.authorize_lambda_exec_role: Refreshing state... [id=demo_authorize_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.get_investment_year_report_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_investment_year_report_lambda_function]
aws_route53_zone.kpinetwork: Refreshing state... [id=Z02521762FZPW0IDM8JJO]
module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object: Refreshing state... [id=lambdas/demo/get_by_metric_report_handler.zip]
module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object: Refreshing state... [id=lambdas/demo/get_edit_modify_data_handler.zip]
module.policy.aws_iam_role.get_all_public_companies_lambda_exec_role: Refreshing state... [id=demo_get_all_public_companies_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.add_investment_lambda_function: Refreshing state... [id=/aws/lambda/demo_add_investment_lambda_function]
module.policy.aws_iam_role.get_universe_overview_lambda_exec_role: Refreshing state... [id=demo_get_universe_overview_lambda_exec_role]
module.policy.aws_iam_role.authorize_lambda_invoke_role: Refreshing state... [id=demo_authorize_lambda_invoke_role]
module.policy.aws_iam_role.delete_company_lambda_exec_role: Refreshing state... [id=demo_delete_company_lambda_exec_role]
module.policy.aws_iam_role.register_lambda_exec_role: Refreshing state... [id=demo_register_lambda_exec_role]
module.policy.aws_iam_role.get_by_metric_report_lambda_exec_role: Refreshing state... [id=demo_get_by_metric_report_lambda_exec_role]
module.policy.aws_iam_policy.lambda_logging: Refreshing state... [id=arn:aws:iam::435552912911:policy/demo_iam_policy_lambda_logging_function_back]
module.policy.aws_iam_role.get_company_permissions_lambda_exec_role: Refreshing state... [id=demo_get_company_permissions_lambda_exec_role]
module.policy.aws_iam_role.get_roles_lambda_exec_role: Refreshing state... [id=demo_get_roles_lambda_exec_role]
module.policy.aws_iam_role.validate_data_lambda_exec_role: Refreshing state... [id=demo_validate_data_lambda_exec_role]
module.policy.aws_iam_role.upload_file_s3_lambda_exec_role: Refreshing state... [id=demo_upload_file_s3_lambda_exec_role]
module.buckets.aws_s3_bucket_object.change_company_publicly_function_object: Refreshing state... [id=lambdas/demo/change_company_publicly_handler.zip]
module.policy.aws_iam_role.get_metric_types_lambda_exec_role: Refreshing state... [id=demo_get_metric_types_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.verify_users_with_same_email_lambda_function: Refreshing state... [id=/aws/lambda/demo_verify_users_with_same_email_lambda_function]
module.policy.aws_iam_role.get_comparison_vs_peers_lambda_exec_role: Refreshing state... [id=demo_get_comparison_vs_peers_lambda_exec_role]
module.sql.aws_db_subnet_group.kpinetwork: Refreshing state... [id=demokpinetwork]
module.policy.aws_iam_role.glue_trigger_lambda_exec_role: Refreshing state... [id=demo_glue_trigger_lambda_exec_role]
module.network.aws_apigatewayv2_stage.stage: Refreshing state... [id=demo]
module.cert.aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:435552912911:certificate/2e6953ea-c466-4ff3-baa9-7e8c3440affa]
module.network.aws_api_gateway_resource.company_report_vs_peers: Refreshing state... [id=mlpebw]
module.network.aws_api_gateway_resource.investment_report: Refreshing state... [id=iew1mv]
module.network.aws_api_gateway_resource.upload_file_s3: Refreshing state... [id=u4or2w]
module.network.aws_api_gateway_resource.investments: Refreshing state... [id=bumysj]
module.network.aws_api_gateway_resource.roles: Refreshing state... [id=7w2rqf]
module.network.aws_api_gateway_resource.edit_modify: Refreshing state... [id=qybsqa]
module.network.aws_api_gateway_resource.comparison_vs_peers: Refreshing state... [id=ygo84c]
module.network.aws_api_gateway_resource.metrics: Refreshing state... [id=8rc63h]
module.network.aws_api_gateway_resource.users: Refreshing state... [id=837cdz]
module.network.aws_api_gateway_resource.universe_overview: Refreshing state... [id=zr5b6w]
module.network.aws_api_gateway_resource.dynamic_report: Refreshing state... [id=7ce5jh]
module.network.aws_api_gateway_resource.investment_date_report: Refreshing state... [id=ymo2z3]
module.network.aws_api_gateway_resource.companies: Refreshing state... [id=bnvar7]
module.network.aws_api_gateway_resource.by_metric_report: Refreshing state... [id=890crw]
module.policy.aws_iam_role_policy_attachment.get_users_lambda_logs: Refreshing state... [id=demo_get_users_lambda_exec_role-20220129002343661500000002]
module.policy.aws_iam_role_policy_attachment.disconnect_lambda_logs: Refreshing state... [id=demo_disconnect_lambda_exec_role-20220420102337857000000001]
module.policy.aws_iam_role_policy_attachment.disconnect_lambda_vpc: Refreshing state... [id=demo_disconnect_lambda_exec_role-20220503145603304000000001]
module.policy.aws_iam_role_policy_attachment.company_investments_lambda_logs: Refreshing state... [id=demo_get_company_investments_lambda_exec_role-20220524212704618600000003]
module.policy.aws_iam_role_policy_attachment.company_investments_lambda_vpc: Refreshing state... [id=demo_get_company_investments_lambda_exec_role-20220524212704613000000001]
module.policy.aws_iam_role_policy_attachment.change_company_publicly_lambda_vpc: Refreshing state... [id=demo_change_company_publicly_lambda_exec_role-20220215163304159600000002]
module.policy.aws_iam_role_policy_attachment.change_company_publicly_lambda_logs: Refreshing state... [id=demo_change_company_publicly_lambda_exec_role-20220215163304155600000001]
module.policy.aws_iam_role_policy_attachment.get_edit_modify_data_lambda_vpc: Refreshing state... [id=demo_get_edit_modify_data_lambda_exec_role-20220623150403266900000002]
module.policy.aws_iam_role_policy_attachment.get_edit_modify_data_lambda_logs: Refreshing state... [id=demo_get_edit_modify_data_lambda_exec_role-20220623150403233500000001]
module.policy.aws_iam_role_policy_attachment.message_lambda_logs: Refreshing state... [id=demo_message_lambda_exec_role-20220420120428768600000001]
module.policy.aws_iam_role_policy_attachment.message_lambda_vpc: Refreshing state... [id=demo_message_lambda_exec_role-20220503145603314500000002]
module.policy.aws_iam_role_policy_attachment.edit_modify_data_lambda_vpc: Refreshing state... [id=demo_edit_modify_data_lambda_exec_role-20220621164117152800000001]
module.policy.aws_iam_role_policy_attachment.edit_modify_data_lambda_logs: Refreshing state... [id=demo_edit_modify_data_lambda_exec_role-20220621164117408200000002]
module.policy.aws_iam_role_policy_attachment.download_comparison_vs_peers_lambda_logs: Refreshing state... [id=demo_download_comparison_vs_peers_lambda_exec_role-20220316135744901200000002]
module.policy.aws_iam_role_policy_attachment.download_comparison_vs_peers_lambda_vpc: Refreshing state... [id=demo_download_comparison_vs_peers_lambda_exec_role-20220316135744896400000001]
module.policy.aws_iam_role_policy_attachment.delete_scenarios_lambda_vpc: Refreshing state... [id=demo_delete_scenarios_lambda_exec_role-20220623230436359500000001]
module.policy.aws_iam_role_policy_attachment.delete_scenarios_lambda_logs: Refreshing state... [id=demo_delete_scenarios_lambda_exec_role-20220623230436404000000002]
module.policy.aws_iam_role_policy_attachment.get_investment_year_options_lambda_logs: Refreshing state... [id=demo_get_investment_year_options_lambda_exec_role-20220609204628159500000004]
module.policy.aws_iam_role_policy_attachment.get_investment_year_options_lambda_vpc: Refreshing state... [id=demo_get_investment_year_options_lambda_exec_role-20220609204628072200000003]
module.policy.aws_iam_role_policy_attachment.add_scenario_lambda_vpc: Refreshing state... [id=demo_add_scenario_lambda_exec_role-20220615164627406700000002]
module.policy.aws_iam_role_policy_attachment.add_scenario_lambda_logs: Refreshing state... [id=demo_add_scenario_lambda_exec_role-20220615164627405600000001]
module.policy.aws_iam_role_policy_attachment.get_user_details_lambda_logs: Refreshing state... [id=demo_get_user_details_lambda_exec_role-20220204083752775200000001]
module.policy.aws_iam_role_policy_attachment.get_user_details_lambda_vpc: Refreshing state... [id=demo_get_user_details_lambda_exec_role-20220216143110620800000001]
module.policy.aws_iam_role_policy_attachment.connect_lambda_logs: Refreshing state... [id=demo_connect_lambda_exec_role-20220420102338091900000002]
module.policy.aws_iam_role_policy_attachment.get_company_report_vs_peers_lambda_logs: Refreshing state... [id=demo_get_company_report_vs_peers_lambda_exec_role-20211217193844110800000001]
module.policy.aws_iam_role_policy_attachment.get_company_report_vs_peers_lambda_vpc: Refreshing state... [id=demo_get_company_report_vs_peers_lambda_exec_role-20211217193844121400000002]
module.policy.aws_iam_role_policy_attachment.update_data_lambda_logs: Refreshing state... [id=demo_update_data_lambda_exec_role-20220601154816818700000001]
module.policy.aws_iam_role_policy_attachment.update_data_lambda_vpc: Refreshing state... [id=demo_update_data_lambda_exec_role-20220601154817160700000002]
module.policy.aws_iam_role_policy_attachment.get_dynamic_report_lambda_vpc: Refreshing state... [id=demo_get_dynamic_report_lambda_exec_role-20220707233328473300000001]
module.policy.aws_iam_role_policy_attachment.get_dynamic_report_lambda_logs: Refreshing state... [id=demo_get_dynamic_report_lambda_exec_role-20220707233328477200000002]
module.policy.aws_iam_role_policy_attachment.get_investment_year_report_lambda_vpc: Refreshing state... [id=demo_get_investment_year_report_lambda_exec_role-20220526204729143000000002]
module.policy.aws_iam_role_policy_attachment.get_investment_year_report_lambda_logs: Refreshing state... [id=demo_get_investment_year_report_lambda_exec_role-20220526204729123500000001]
module.policy.aws_iam_role_policy_attachment.get_company_details_lambda_vpc: Refreshing state... [id=demo_get_company_details_lambda_exec_role-20220609204627925600000001]
module.policy.aws_iam_role_policy_attachment.get_company_details_lambda_logs: Refreshing state... [id=demo_get_company_details_lambda_exec_role-20220609204628035400000002]
module.policy.aws_iam_role_policy_attachment.add_investment_lambda_vpc: Refreshing state... [id=demo_add_investment_lambda_exec_role-20220524212704618600000002]
module.policy.aws_iam_role_policy_attachment.add_investment_lambda_logs: Refreshing state... [id=demo_add_investment_lambda_exec_role-20220524212705003500000004]
module.policy.aws_iam_role_policy_attachment.change_user_role_lambda_vpc: Refreshing state... [id=demo_change_user_role_lambda_exec_role-20220223170127271200000001]
module.policy.aws_iam_role_policy_attachment.change_user_role_lambda_logs: Refreshing state... [id=demo_change_user_role_lambda_exec_role-20220223170127368000000002]
module.policy.aws_iam_role_policy_attachment.assign_company_permissions_lambda_logs: Refreshing state... [id=demo_assign_company_permissions_lambda_exec_role-20220214140917367200000002]
module.policy.aws_iam_role_policy_attachment.assign_company_permissions_lambda_vpc: Refreshing state... [id=demo_assign_company_permissions_lambda_exec_role-20220214140917365700000001]
module.policy.aws_iam_role_policy_attachment.add_user_to_customer_group_lambda_logs: Refreshing state... [id=demo_add_user_to_customer_group_lambda_exec_role-20220105181813257800000001]
module.policy.aws_iam_role_policy_attachment.companies_lambda_vpc: Refreshing state... [id=demo_companies_lambda_exec_role-20211104145748993600000001]
module.policy.aws_iam_role_policy_attachment.companies_lambda_logs: Refreshing state... [id=demo_companies_lambda_exec_role-20211104145749002900000004]
module.policy.aws_iam_role_policy_attachment.verify_users_with_same_email_lambda_logs: Refreshing state... [id=demo_verify_users_with_same_email_exec_role-20220127183123476100000001]
module.policy.aws_iam_role_policy_attachment.authorize_lambda_logs: Refreshing state... [id=demo_authorize_lambda_exec_role-20220113125137753300000001]
module.policy.aws_iam_role_policy_attachment.get_investment_date_report_lambda_vpc: Refreshing state... [id=demo_get_investment_date_report_lambda_exec_role-20220901212003397600000001]
module.policy.aws_iam_role_policy_attachment.get_investment_date_report_lambda_logs: Refreshing state... [id=demo_get_investment_date_report_lambda_exec_role-20220901212003402400000002]
module.policy.aws_iam_role_policy_attachment.get_all_public_companies_lambda_logs: Refreshing state... [id=demo_get_all_public_companies_lambda_exec_role-20220217204143305700000001]
module.policy.aws_iam_role_policy_attachment.get_all_public_companies_lambda_vpc: Refreshing state... [id=demo_get_all_public_companies_lambda_exec_role-20220217204143307800000002]
module.policy.aws_iam_role_policy_attachment.get_users_lambda_vpc: Refreshing state... [id=demo_get_universe_overview_lambda_exec_role-20220129002338871000000001]
module.policy.aws_iam_role_policy_attachment.get_universe_overview_lambda_vpc: Refreshing state... [id=demo_get_universe_overview_lambda_exec_role-20211209154733547200000002]
module.policy.aws_iam_role_policy_attachment.get_universe_overview_lambda_logs: Refreshing state... [id=demo_get_universe_overview_lambda_exec_role-20211209154733547100000001]
module.policy.aws_iam_role_policy.authorize_lambda_invoke_policy: Refreshing state... [id=demo_authorize_lambda_invoke_role:demo_authorize_lambda_invoke_policy]
module.policy.aws_iam_role_policy_attachment.delete_company_lambda_vpc: Refreshing state... [id=demo_delete_company_lambda_exec_role-20220630164119918000000001]
module.policy.aws_iam_role_policy_attachment.delete_company_lambda_logs: Refreshing state... [id=demo_delete_company_lambda_exec_role-20220630164119943200000002]
module.policy.aws_iam_role_policy_attachment.register_lambda_logs: Refreshing state... [id=demo_register_lambda_exec_role-20220427122624952100000001]
module.policy.aws_iam_role_policy_attachment.register_lambda_vpc: Refreshing state... [id=demo_register_lambda_exec_role-20220503143910016300000001]
module.policy.aws_iam_role_policy_attachment.get_by_metric_report_lambda_logs: Refreshing state... [id=demo_get_by_metric_report_lambda_exec_role-20220606213648088100000002]
module.policy.aws_iam_role_policy_attachment.get_by_metric_report_lambda_vpc: Refreshing state... [id=demo_get_by_metric_report_lambda_exec_role-20220606213648074600000001]
module.sql.aws_db_instance.kpinetwork_db: Refreshing state... [id=demokpinetworkdb]
module.network.aws_api_gateway_resource.company_report_vs_peers_id: Refreshing state... [id=wycmf0]
module.policy.aws_iam_role_policy_attachment.validate_data_lambda_vpc: Refreshing state... [id=demo_validate_data_lambda_exec_role-20220505163629032800000002]
module.policy.aws_iam_role_policy_attachment.validate_data_lambda_logs: Refreshing state... [id=demo_validate_data_lambda_exec_role-20220505163628999400000001]
module.policy.aws_iam_role_policy_attachment.get_company_permissions_lambda_vpc: Refreshing state... [id=demo_get_company_permissions_lambda_exec_role-20220216143113048700000003]
module.policy.aws_iam_role_policy_attachment.get_company_permissions_lambda_logs: Refreshing state... [id=demo_get_company_permissions_lambda_exec_role-20220216143113047800000002]
module.network.aws_api_gateway_resource.investment_report_id: Refreshing state... [id=ieupa8]
module.network.aws_api_gateway_resource.invest_year_options: Refreshing state... [id=gq814s]
module.policy.aws_iam_role_policy_attachment.get_roles_lambda_logs: Refreshing state... [id=demo_get_roles_lambda_exec_role-20220201183736169200000001]
module.network.aws_api_gateway_resource.comparison_vs_peers_id: Refreshing state... [id=jtuqjb]
module.policy.aws_iam_role_policy_attachment.get_metric_types_lambda_vpc: Refreshing state... [id=demo_get_metric_types_lambda_exec_role-20220714150845149600000001]
module.policy.aws_iam_role_policy_attachment.get_metric_types_lambda_logs: Refreshing state... [id=demo_get_metric_types_lambda_exec_role-20220714150846115600000002]
module.network.aws_api_gateway_resource.metric_types: Refreshing state... [id=qg9lk5]
module.network.aws_api_gateway_resource.user: Refreshing state... [id=zhsk31]
module.policy.aws_iam_role_policy_attachment.glue_trigger_lambda_glue_access: Refreshing state... [id=demo_glue_trigger_lambda_exec_role-20211108151916085000000001]
module.policy.aws_iam_role_policy_attachment.glue_trigger_lambda_logs: Refreshing state... [id=demo_glue_trigger_lambda_exec_role-20211108151916088000000002]
module.network.aws_api_gateway_resource.dynamic_report_id: Refreshing state... [id=1c508f]
module.policy.aws_iam_role_policy_attachment.upload_file_s3_lambda_logs: Refreshing state... [id=demo_upload_file_s3_lambda_exec_role-20220411202109965800000001]
module.policy.aws_iam_role_policy.upload_file_s3_policy: Refreshing state... [id=demo_upload_file_s3_lambda_exec_role:demo_upload_file_s3_policy]
module.network.aws_api_gateway_resource.by_metric_report_id: Refreshing state... [id=f4ao8c]
module.network.aws_api_gateway_resource.change_company_publicly: Refreshing state... [id=eeb9pt]
module.network.aws_api_gateway_resource.public_companies: Refreshing state... [id=4v8ab4]
module.network.aws_api_gateway_resource.company_details: Refreshing state... [id=hper4a]
module.policy.aws_iam_role_policy_attachment.get_comparison_vs_peers_lambda_vpc: Refreshing state... [id=demo_get_comparison_vs_peers_lambda_exec_role-20211222131917590600000002]
module.policy.aws_iam_role_policy_attachment.get_comparison_vs_peers_lambda_logs: Refreshing state... [id=demo_get_comparison_vs_peers_lambda_exec_role-20211222131917584000000001]
module.network.aws_api_gateway_resource.company_investments: Refreshing state... [id=jd2xz9]
module.network.aws_api_gateway_resource.validate_data: Refreshing state... [id=pi6a5s]
module.network.aws_api_gateway_resource.download_comparison_vs_peers: Refreshing state... [id=zgaw7c]
module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment: Refreshing state... [id=wdve7j]
module.network.aws_api_gateway_resource.user_roles: Refreshing state... [id=npbrdw]
module.network.aws_api_gateway_resource.company_permissions: Refreshing state... [id=28s2ly]
module.functions.aws_lambda_layer_version.db_lambda_layer: Refreshing state... [id=arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22]
module.policy.aws_iam_role_policy.allow_execute_api_message_connection: Refreshing state... [id=demo_message_lambda_exec_role:demo_allow_execute_api_message_connection_policy]
module.policy.aws_lambda_permission.websocket_disconnect: Refreshing state... [id=AllowExecutionFromApiGateway]
module.policy.aws_lambda_permission.websocket_register: Refreshing state... [id=AllowExecutionFromApiGateway]
module.policy.aws_lambda_permission.websocket_connect: Refreshing state... [id=AllowExecutionFromApiGateway]
module.policy.aws_lambda_permission.websocket_message: Refreshing state... [id=AllowExecutionFromApiGateway]
module.policy.aws_iam_role_policy.allow_execute_api_register_connection: Refreshing state... [id=demo_register_lambda_exec_role:demo_allow_execute_api_register_connection_policy]
module.network.aws_api_gateway_resource.scenarios: Refreshing state... [id=0bc6fs]
module.dns.aws_route53_record.cert_validations[0]: Refreshing state... [id=Z02521762FZPW0IDM8JJO__24e3048f36be454712f534258ba1d3c2.api.demo.kpinetwork.com._CNAME]
module.dns.aws_route53_record.cert_validations[1]: Refreshing state... [id=Z02521762FZPW0IDM8JJO__24e3048f36be454712f534258ba1d3c2.api.demo.kpinetwork.com._CNAME]
module.functions.aws_lambda_function.connect_lambda_function: Refreshing state... [id=demo_connect_lambda_function]
module.functions.aws_lambda_function.upload_file_s3_lambda_function: Refreshing state... [id=demo_upload_file_s3_lambda_function]
module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function: Refreshing state... [id=demo_add_user_to_customer_group_lambda_function]
module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function: Refreshing state... [id=demo_verify_users_with_same_email_lambda_function]
module.functions.aws_lambda_function.glue_trigger_lambda_function: Refreshing state... [id=demo_glue_trigger_lambda_function]
module.functions.aws_lambda_function.register_lambda_function: Refreshing state... [id=demo_register_lambda_function]
module.functions.aws_lambda_function.validate_data_lambda_function: Refreshing state... [id=demo_validate_data_lambda_function]
module.functions.aws_lambda_function.disconnect_lambda_function: Refreshing state... [id=demo_disconnect_lambda_function]
module.functions.aws_lambda_function.get_investment_year_options_lambda_function: Refreshing state... [id=demo_get_investment_year_options_lambda_function]
module.functions.aws_lambda_function.get_company_investments_lambda_function: Refreshing state... [id=demo_get_company_investments_lambda_function]
module.codebuild.aws_codebuild_project.rds_migrations: Refreshing state... [id=arn:aws:codebuild:us-west-2:435552912911:project/demo_rds_migrations]
module.functions.aws_lambda_function.get_metric_types_lambda_function: Refreshing state... [id=demo_get_metric_types_lambda_function]
module.functions.aws_lambda_function.message_lambda_function: Refreshing state... [id=demo_message_lambda_function]
module.functions.aws_lambda_function.add_investment_lambda_function: Refreshing state... [id=demo_add_investment_lambda_function]
module.functions.aws_lambda_function.update_data_lambda_function: Refreshing state... [id=demo_update_data_lambda_function]
module.functions.aws_lambda_function.get_all_companies_lambda_function: Refreshing state... [id=demo_get_all_companies_lambda_function]
module.functions.aws_lambda_permission.glue_trigger_event_permission: Refreshing state... [id=AllowExecutionFromS3Bucket]
module.cognito.aws_cognito_user_pool.pool: Refreshing state... [id=us-west-2_usXw4S12D]
module.cert.aws_acm_certificate_validation.cert: Refreshing state... [id=2022-09-15 02:59:51.475 +0000 UTC]
module.cognito.aws_lambda_permission.allow_post_confirmation_from_user_pool: Refreshing state... [id=AllowPostConfirmationFromUserPool]
module.cognito.aws_cognito_user_group.admin: Refreshing state... [id=us-west-2_usXw4S12D/demo_admin_group]
module.policy.aws_iam_role_policy.authorize_lambda_get_users_and_groups: Refreshing state... [id=demo_get_users_lambda_exec_role:demo_authorize_lambda_get_users_and_groups]
module.policy.aws_lambda_permission.allow_pre_signup_from_user_pool: Refreshing state... [id=AllowPreSignUpFromUserPool]
module.policy.aws_iam_role_policy.verify_users_with_same_email_lambda_list_users_policy: Refreshing state... [id=demo_verify_users_with_same_email_exec_role:demo_verify_users_with_same_email_lambda_list_users_policy]
module.cognito.aws_cognito_user_pool_client.amplify: Refreshing state... [id=3917dpipsnpi2i8uofiovmn2jr]
module.cognito.aws_cognito_user_group.customer: Refreshing state... [id=us-west-2_usXw4S12D/demo_customer_group]
module.policy.aws_iam_policy.add_user_to_customer_group_policy: Refreshing state... [id=arn:aws:iam::435552912911:policy/demo_post_configuration_trigger_policy]
module.policy.aws_iam_role_policy.get_company_permissions_cognito_policy: Refreshing state... [id=demo_get_company_permissions_lambda_exec_role:demo_get_company_permissions_cognito_policy]
module.policy.aws_iam_role_policy.get_edit_modify_data_cognito_policy: Refreshing state... [id=demo_get_edit_modify_data_lambda_exec_role:demo_get_edit_modify_data_cognito_policy]
module.policy.aws_iam_role_policy.get_by_metric_report_cognito_policy: Refreshing state... [id=demo_get_by_metric_report_lambda_exec_role:demo_get_by_metric_report_cognito_policy]
module.policy.aws_iam_role_policy.get_company_details_cognito_policy: Refreshing state... [id=demo_get_company_details_lambda_exec_role:demo_get_company_details_cognito_policy]
module.policy.aws_iam_role_policy.get_investment_date_report_cognito_policy: Refreshing state... [id=demo_get_investment_date_report_lambda_exec_role:demo_get_investment_date_report_cognito_policy]
module.policy.aws_iam_role_policy.download_comparison_vs_peers_cognito_policy: Refreshing state... [id=demo_download_comparison_vs_peers_lambda_exec_role:demo_download_comparison_vs_peers_cognito_policy]
module.policy.aws_iam_role_policy.get_dynamic_report_cognito_policy: Refreshing state... [id=demo_get_dynamic_report_lambda_exec_role:demo_get_dynamic_report_cognito_policy]
module.policy.aws_iam_role_policy.assign_company_permissions_cognito_policy: Refreshing state... [id=demo_assign_company_permissions_lambda_exec_role:demo_assign_company_permissions_cognito_policy]
module.policy.aws_iam_role_policy.get_roles_cognito_policy: Refreshing state... [id=demo_get_roles_lambda_exec_role:demo_get_roles_cognito_policy]
module.policy.aws_iam_role_policy.get_comparison_vs_peers_cognito_policy: Refreshing state... [id=demo_get_comparison_vs_peers_lambda_exec_role:demo_get_comparison_vs_peers_cognito_policy]
module.policy.aws_iam_role_policy.get_user_details_cognito_policy: Refreshing state... [id=demo_get_user_details_lambda_exec_role:demo_get_user_details_cognito_policy]
module.policy.aws_iam_role_policy.edit_modify_data_cognito_policy: Refreshing state... [id=demo_edit_modify_data_lambda_exec_role:demo_edit_modify_data_cognito_policy]
module.policy.aws_iam_role_policy.get_investment_year_report_cognito_policy: Refreshing state... [id=demo_get_investment_year_report_lambda_exec_role:demo_get_investment_year_report_cognito_policy]
module.policy.aws_iam_role_policy.change_company_publicly_cognito_policy: Refreshing state... [id=demo_change_company_publicly_lambda_exec_role:demo_change_company_publicly_cognito_policy]
module.policy.aws_iam_role_policy.get_universe_overview_cognito_policy: Refreshing state... [id=demo_get_universe_overview_lambda_exec_role:demo_get_universe_overview_cognito_policy]
module.policy.aws_iam_role_policy.delete_company_cognito_policy: Refreshing state... [id=demo_delete_company_lambda_exec_role:demo_delete_company_cognito_policy]
module.policy.aws_iam_role_policy.get_all_public_companies_cognito_policy: Refreshing state... [id=demo_get_all_public_companies_lambda_exec_role:demo_get_all_public_companies_cognito_policy]
module.policy.aws_iam_role_policy.change_user_role_cognito_policy: Refreshing state... [id=demo_change_user_role_lambda_exec_role:demo_change_user_role_cognito_policy]
module.policy.aws_iam_role_policy.get_company_report_vs_peers_cognito_policy: Refreshing state... [id=demo_get_company_report_vs_peers_lambda_exec_role:demo_get_company_report_vs_peers_cognito_policy]
module.policy.aws_iam_role_policy.delete_scenarios_cognito_policy: Refreshing state... [id=demo_delete_scenarios_lambda_exec_role:demo_delete_scenarios_cognito_policy]
module.policy.aws_iam_role_policy.add_scenario_cognito_policy: Refreshing state... [id=demo_add_scenario_lambda_exec_role:demo_add_scenario_cognito_policy]
module.functions.aws_lambda_function.assign_company_permissions_lambda_function: Refreshing state... [id=demo_assign_company_permissions_lambda_function]
module.functions.aws_lambda_function.get_user_details_lambda_function: Refreshing state... [id=demo_get_user_details_lambda_function]
module.functions.aws_lambda_function.change_company_publicly_lambda_function: Refreshing state... [id=demo_change_company_publicly_lambda_function]
module.functions.aws_lambda_function.get_investment_date_report_lambda_function: Refreshing state... [id=demo_get_investment_date_report_lambda_function]
module.functions.aws_lambda_function.get_edit_modify_data_lambda_function: Refreshing state... [id=demo_get_edit_modify_data_lambda_function]
module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function: Refreshing state... [id=demo_get_company_report_vs_peers_lambda_function]
module.functions.aws_lambda_function.get_universe_overview_lambda_function: Refreshing state... [id=demo_get_universe_overview_lambda_function]
module.functions.aws_lambda_function.get_investment_year_report_lambda_function: Refreshing state... [id=demo_get_investment_year_report_lambda_function]
module.functions.aws_lambda_function.get_users_lambda_function: Refreshing state... [id=demo_get_users_lambda_function]
module.functions.aws_lambda_function.get_dynamic_report_lambda_function: Refreshing state... [id=demo_get_dynamic_report_lambda_function]
module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function: Refreshing state... [id=demo_download_comparison_vs_peers_lambda_function]
module.functions.aws_lambda_function.get_company_permissions_lambda_function: Refreshing state... [id=demo_get_company_permissions_lambda_function]
module.functions.aws_lambda_function.change_user_role_lambda_function: Refreshing state... [id=demo_change_user_role_lambda_function]
module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function: Refreshing state... [id=demo_get_comparison_vs_peers_lambda_function]
module.functions.aws_lambda_function.edit_modify_data_lambda_function: Refreshing state... [id=demo_edit_modify_data_lambda_function]
module.functions.aws_lambda_function.get_all_public_companies_lambda_function: Refreshing state... [id=demo_get_all_public_companies_lambda_function]
module.functions.aws_lambda_function.get_by_metric_report_lambda_function: Refreshing state... [id=demo_get_by_metric_report_lambda_function]
module.functions.aws_lambda_function.delete_scenarios_lambda_function: Refreshing state... [id=demo_delete_scenarios_lambda_function]
module.functions.aws_lambda_function.delete_company_lambda_function: Refreshing state... [id=demo_delete_company_lambda_function]
module.functions.aws_lambda_function.get_roles_lambda_function: Refreshing state... [id=demo_get_roles_lambda_function]
module.functions.aws_lambda_function.add_scenario_lambda_function: Refreshing state... [id=demo_add_scenario_lambda_function]
module.functions.aws_lambda_function.get_company_details_lambda_function: Refreshing state... [id=demo_get_company_details_lambda_function]
module.policy.aws_iam_role_policy_attachment.add_user_to_customer_group_lambda_cognito_policy: Refreshing state... [id=demo_add_user_to_customer_group_lambda_exec_role-20220107163139048600000001]
module.functions.aws_lambda_function.authorize_lambda_function: Refreshing state... [id=demo_authorize_lambda_function]
module.network.aws_api_gateway_domain_name.domain: Refreshing state... [id=api.demo.kpinetwork.com]
module.dns.aws_route53_record.kpinetwork_domain: Refreshing state... [id=Z02521762FZPW0IDM8JJO_api.demo.kpinetwork.com_A]
module.network.aws_api_gateway_base_path_mapping.domain_mapping: Refreshing state... [id=api.demo.kpinetwork.com/]
module.network.aws_apigatewayv2_integration.register_integration: Refreshing state... [id=qzrgtru]
module.network.aws_api_gateway_authorizer.kpi_authorizer: Refreshing state... [id=3y14fs]
module.network.aws_apigatewayv2_integration.connect_integration: Refreshing state... [id=lov27i5]
module.network.aws_apigatewayv2_integration.message_integration: Refreshing state... [id=bwwsvap]
module.network.aws_apigatewayv2_integration.disconnect_integration: Refreshing state... [id=usm7qx9]
module.network.aws_api_gateway_method.upload_file_s3_method: Refreshing state... [id=agm-kb7gblbu69-u4or2w-POST]
module.network.aws_api_gateway_method.dynamic_report_method: Refreshing state... [id=agm-kb7gblbu69-1c508f-GET]
module.network.aws_api_gateway_method.get_roles_method: Refreshing state... [id=agm-kb7gblbu69-7w2rqf-GET]
module.network.aws_api_gateway_method.validate_data_method: Refreshing state... [id=agm-kb7gblbu69-pi6a5s-POST]
module.network.aws_api_gateway_method.download_comparison_vs_peers_method: Refreshing state... [id=agm-kb7gblbu69-zgaw7c-GET]
module.network.aws_api_gateway_method.get_company_details_method: Refreshing state... [id=agm-kb7gblbu69-hper4a-GET]
module.network.aws_api_gateway_method.get_universe_overview_method: Refreshing state... [id=agm-kb7gblbu69-zr5b6w-GET]
module.network.aws_api_gateway_method.delete_scenarios_method: Refreshing state... [id=agm-kb7gblbu69-0bc6fs-DELETE]
module.network.aws_api_gateway_method.get_all_companies_method: Refreshing state... [id=agm-kb7gblbu69-bnvar7-GET]
module.network.aws_api_gateway_method.add_scenario_method: Refreshing state... [id=agm-kb7gblbu69-0bc6fs-POST]
module.network.aws_api_gateway_method.get_all_public_companies_method: Refreshing state... [id=agm-kb7gblbu69-4v8ab4-GET]
module.network.aws_api_gateway_method.edit_modify_data_method: Refreshing state... [id=agm-kb7gblbu69-qybsqa-PUT]
module.network.aws_api_gateway_method.get_edit_modify_data_method: Refreshing state... [id=agm-kb7gblbu69-qybsqa-GET]
module.network.aws_api_gateway_method.get_investment_date_report_method: Refreshing state... [id=agm-kb7gblbu69-ymo2z3-GET]
module.network.aws_api_gateway_method.get_users_method: Refreshing state... [id=agm-kb7gblbu69-837cdz-GET]
module.network.aws_api_gateway_method.change_user_role_method: Refreshing state... [id=agm-kb7gblbu69-npbrdw-PUT]
module.network.aws_api_gateway_method.get_by_metric_report_method: Refreshing state... [id=agm-kb7gblbu69-f4ao8c-GET]
module.network.aws_api_gateway_method.assign_company_permissions_method: Refreshing state... [id=agm-kb7gblbu69-28s2ly-PUT]
module.network.aws_api_gateway_method.get_comparison_vs_peers_method: Refreshing state... [id=agm-kb7gblbu69-jtuqjb-GET]
module.network.aws_api_gateway_method.add_investment_method: Refreshing state... [id=agm-kb7gblbu69-jd2xz9-POST]
module.network.aws_api_gateway_method.delete_company_method: Refreshing state... [id=agm-kb7gblbu69-hper4a-DELETE]
module.network.aws_api_gateway_method.change_company_publicly_method: Refreshing state... [id=agm-kb7gblbu69-eeb9pt-PUT]
module.network.aws_api_gateway_method.get_metric_types_method: Refreshing state... [id=agm-kb7gblbu69-qg9lk5-GET]
module.network.aws_api_gateway_method.get_investment_year_report_method: Refreshing state... [id=agm-kb7gblbu69-ieupa8-GET]
module.network.aws_api_gateway_method.get_company_permissions_method: Refreshing state... [id=agm-kb7gblbu69-28s2ly-GET]
module.network.aws_api_gateway_method.get_user_details_method: Refreshing state... [id=agm-kb7gblbu69-zhsk31-GET]
module.network.aws_api_gateway_method.get_company_investments_method: Refreshing state... [id=agm-kb7gblbu69-jd2xz9-GET]
module.network.aws_api_gateway_method.get_investment_year_options_method: Refreshing state... [id=agm-kb7gblbu69-gq814s-GET]
module.network.aws_api_gateway_method.get_company_report_vs_peers_method: Refreshing state... [id=agm-kb7gblbu69-wycmf0-GET]
module.network.aws_apigatewayv2_route.register_route: Refreshing state... [id=f5rytev]
module.network.aws_apigatewayv2_route.message_route: Refreshing state... [id=b6359n3]
module.network.aws_apigatewayv2_route.connect_route: Refreshing state... [id=lb55rfq]
module.network.aws_apigatewayv2_route.disconnect_route: Refreshing state... [id=i6ilvcd]
module.network.aws_api_gateway_integration.validate_data_integration: Refreshing state... [id=agi-kb7gblbu69-pi6a5s-POST]
module.network.aws_api_gateway_integration.dynamic_report_integration: Refreshing state... [id=agi-kb7gblbu69-1c508f-GET]
module.network.aws_api_gateway_integration.download_comparison_vs_peers_integration: Refreshing state... [id=agi-kb7gblbu69-zgaw7c-GET]
module.network.aws_api_gateway_integration.upload_file_s3_integration: Refreshing state... [id=agi-kb7gblbu69-u4or2w-POST]
module.network.aws_api_gateway_integration.get_company_details_integration: Refreshing state... [id=agi-kb7gblbu69-hper4a-GET]
module.network.aws_api_gateway_integration.get_roles_integration: Refreshing state... [id=agi-kb7gblbu69-7w2rqf-GET]
module.network.aws_api_gateway_integration.universe_overview_integration: Refreshing state... [id=agi-kb7gblbu69-zr5b6w-GET]
module.network.aws_api_gateway_integration.delete_scenarios_integration: Refreshing state... [id=agi-kb7gblbu69-0bc6fs-DELETE]
module.network.aws_api_gateway_integration.companies_integration: Refreshing state... [id=agi-kb7gblbu69-bnvar7-GET]
module.network.aws_api_gateway_integration.add_company_scenario_integration: Refreshing state... [id=agi-kb7gblbu69-0bc6fs-POST]
module.network.aws_api_gateway_integration.public_companies_integration: Refreshing state... [id=agi-kb7gblbu69-4v8ab4-GET]
module.network.aws_api_gateway_integration.get_edit_modify_data_integration: Refreshing state... [id=agi-kb7gblbu69-qybsqa-GET]
module.network.aws_api_gateway_integration.edit_modify_data_integration: Refreshing state... [id=agi-kb7gblbu69-qybsqa-PUT]
module.network.aws_api_gateway_integration.users_integration: Refreshing state... [id=agi-kb7gblbu69-837cdz-GET]
module.network.aws_api_gateway_integration.investment_date_report_integration: Refreshing state... [id=agi-kb7gblbu69-ymo2z3-GET]
module.network.aws_api_gateway_integration.change_user_role_integration: Refreshing state... [id=agi-kb7gblbu69-npbrdw-PUT]
module.network.aws_api_gateway_integration.by_metric_report_integration: Refreshing state... [id=agi-kb7gblbu69-f4ao8c-GET]
module.network.aws_api_gateway_integration.assign_company_permissions_integration: Refreshing state... [id=agi-kb7gblbu69-28s2ly-PUT]
module.network.aws_api_gateway_integration.delete_company_integration: Refreshing state... [id=agi-kb7gblbu69-hper4a-DELETE]
module.network.aws_api_gateway_integration.comparison_vs_peers_integration: Refreshing state... [id=agi-kb7gblbu69-jtuqjb-GET]
module.network.aws_api_gateway_integration.change_company_publicly_integration: Refreshing state... [id=agi-kb7gblbu69-eeb9pt-PUT]
module.network.aws_api_gateway_integration.get_metric_types_integration: Refreshing state... [id=agi-kb7gblbu69-qg9lk5-GET]
module.network.aws_api_gateway_integration.investment_report_integration: Refreshing state... [id=agi-kb7gblbu69-ieupa8-GET]
module.network.aws_api_gateway_integration.add_investment_integration: Refreshing state... [id=agi-kb7gblbu69-jd2xz9-POST]
module.network.aws_api_gateway_integration.get_company_permissions_integration: Refreshing state... [id=agi-kb7gblbu69-28s2ly-GET]
module.network.aws_api_gateway_integration.user_details_integration: Refreshing state... [id=agi-kb7gblbu69-zhsk31-GET]
module.network.aws_api_gateway_integration.company_report_vs_peers_integration: Refreshing state... [id=agi-kb7gblbu69-wycmf0-GET]
module.network.aws_api_gateway_integration.company_investments_integration: Refreshing state... [id=agi-kb7gblbu69-jd2xz9-GET]
module.network.aws_api_gateway_integration.invest_year_options_integration: Refreshing state... [id=agi-kb7gblbu69-gq814s-GET]
module.network.aws_apigatewayv2_deployment.deploy: Refreshing state... [id=ey3sgf]
module.policy.aws_lambda_permission.apigw_upload_file_s3_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayUploadFileS3]
module.policy.aws_lambda_permission.apigw_download_comparison_vs_peers_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_add_investment_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayAddInvestmentId]
module.policy.aws_lambda_permission.apigw_change_company_publicly_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayChangeCompanyPublicly]
module.policy.aws_lambda_permission.apigw_get_all_companies_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_delete_company_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayCompanyId]
module.policy.aws_lambda_permission.apigw_get_universe_overview_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayRuleOf40]
module.policy.aws_lambda_permission.apigw_get_investment_year_report_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_get_all_public_companies_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_get_investment_year_options_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_get_users_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayGetUsers]
module.policy.aws_lambda_permission.apigw_add_scenario_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayCompanyId]
module.policy.aws_lambda_permission.apigw_get_by_metric_report_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_company_investments_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayGetCompanyInvestmentsId]
module.policy.aws_lambda_permission.apigw_get_comparison_vs_peers_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayRuleOf40]
module.policy.aws_lambda_permission.apigw_get_company_permissions_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayGetCompanyPermissions]
module.policy.aws_lambda_permission.apigw_validate_data_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayValidateData]
module.policy.aws_lambda_permission.apigw_get_edit_modify_data_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_edit_modify_data_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_get_dynamic_report_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_change_user_role_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayChangeUserRole]
module.policy.aws_lambda_permission.apigw_assign_company_permissions_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_get_metric_types_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayRuleOf40]
module.policy.aws_lambda_permission.apigw_get_investment_date_report_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_get_company_details_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayCompanyId]
module.policy.aws_lambda_permission.apigw_get_user_details_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayGetUserDetails]
module.policy.aws_lambda_permission.apigw_get_roles_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayGetRoles]
module.policy.aws_lambda_permission.apigw_get_company_report_vs_peers_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayRuleOf40]
module.policy.aws_lambda_permission.apigw_delete_scenarios_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayAddInvestmentId]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "77b7d61b5d3fa5da1efbddf88c89d6a7" -> "5f463caff35a8dd364f531c7504de3be"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "fe67e98fd56df7809f42e62c857e9c45" -> "6478069a68bf67ba95bf2e5d3b91e364"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "d92badc46a72a70bccbd2a63615da7a9" -> "7fdf4d119e4c1399cf46c139f09d8db6"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "496bb5ff0d6d0190aa7d08b8b286e595" -> "943dca9918c48dca26bb63c7529cedd3"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "8d5d7db537957f6e608027f9a750856c" -> "4684cabbfbb77e65002ca2c290291823"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "909f631609415403e4546365b19ed7b9" -> "6a2b618c2ec584ef04ded6d89fec9fd3"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "1175eb3c563494fd26c478d2cb9a8c80" -> "9340f27fb57bdb414e01d1faa4305020"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "8d69000297b9b6566af01390d6430f1c" -> "f7e061e4d5423961f918447e87418d44"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "6e21e1588b6ea6846950e1d06ace9a2d" -> "411dd305e9ad809f2307cb10e4fe333b"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "1ca1192b5c43d21f878e9c04473be7aa" -> "2ebaa47e7765dcc02f4b441925378ab2"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "e1a59f70691d963ffe2d4e553471316d" -> "14cb9400fc62a6fd9adc5fe66ba54ef5"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "291f547c128dd74bad658c9553d60740" -> "b0d1a317d38d29989ae9c12fbfbd5f66"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "a452bbc1d22ea2f143e76c61e9603d85" -> "69d131be1cf7bfba23e1deaa2fa3e865"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "c58b1e062af99d900ac68c602bc74d4d" -> "f73ff4aaf3318a61b8882c22373830af"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "730953baf5285df9cf1cb27a37098fa9" -> "994d20a31d763b3567ae914630d487d6"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "389e35e291dd3fd38a98d2e85283d130" -> "37319a6f76cd46c54d51c801ccc0521b"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "d92622e7d86adad6d7815561c8e4f290" -> "0c3bea5dcd09103f16e1dd5af053860e"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "ab04c467451bcd8247ba3a48b4c5f7e3" -> "7081901d833bfb37eb744e69010c82a5"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "f660766bd9f45abaff01c8afbd1930fc" -> "3a7593474dcc2a7992364785eaf2e4ee"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "a9f0447e0d48c1543a34c3ca899f00f4" -> "12ac7680b93fe170a62630cf52dabb9d"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "16332e3a2ff7cfa8423010719e450c52" -> "85925cace649f7c022939c7a4e85e15b"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "911b4cfe4a492023936c141dd1830313" -> "dd8c8dd68634b7ddef63221cd9953935"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "c9e84d3f23710949be0467813947696c" -> "ae875d1788c3be1b3c20c5ed6c1564ef"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "8acb2b657ce337c32d73f6634c0d8012" -> "6bea97d35bde466cb6e4e32fc7c134f7"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_year_options_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_year_options_function_object" {
      ~ etag               = "1fe0e1235f31312c0423e6e151b73100" -> "165571bfdb696e815329925312a299f7"
        id                 = "lambdas/demo/get_investment_year_options_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_year_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_year_report_function_object" {
      ~ etag               = "8a37f6051f84497159f1c246f3318e6d" -> "c27ac0feff763c7ff4430df96a8da9ab"
        id                 = "lambdas/demo/get_investment_year_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "d1db49c52d54c4377e3097568f685b90" -> "236c5d7f513e07054d625f1b3901705a"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "51c1b6868ecc10440eb8fab58ee08f73" -> "dcd1a6ae0a92a630dd781f65fe92c600"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "a15daac980db0aa106b563e3b929b4a9" -> "64562ae9e7866956bb33379a71c627ce"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "182ab50e24f1017e8c2478d0c6744693" -> "c4bcd90747d0d1d1290c5fb2bb2b071e"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "548acc51ca918d50471e04ad1626320e" -> "6fa257dfb4785eb4a8022e2c222492bd"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "944c8f2d1ab021fab7d51592fb5c420b" -> "77a3c75af4b9ec846b8a55d2d01d2876"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "0b5a9d5e8729b62f9a766a4b7fd44f52" -> "4a667db04e00fc614ac390d1067e16b6"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "fec04bf89294039af7f12cf7d123872e" -> "9a9f44abbf3e7a5b5c5bcb7cceb98f39"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "1fe52fd64010c8b1d135a249d02c0f05" -> "7b3115385964dd28db98f64ed5b67aaa"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "42cdaed161941902bd4735c434dec5e3" -> "b0ea1a5391475187d26b4ed4c31b4456"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "53decc18ba4c79b5bc6f83b2a4edfed4" -> "5035cb64a088b2f362d788f8244ec13b"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "6b0b9216b20c24db0dd7f396320a7bc3" -> "dbc3c64ece28f3da2a28a6b2a77be426"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "91d93bb574f912864d3f9fc920e2fd38" -> "912a72b85fd4bf55e1071d6f03cffcd9"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:57.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ] -> (known after apply)
      ~ source_code_hash               = "fshoLqWU6fXKFSqWOB9x6qZk20pMfOubg6NLKly5lTI=" -> "tzd263SQ5RZ99WhDmoH0DZVBIV1bAuFOqYy4CRpCN+w="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2022-09-30T18:09:17.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ] -> (known after apply)
      ~ source_code_hash               = "7Sqlb907IxeKsx+Nl/wmdAtxw46S8AcNifvelIH+htw=" -> "tKQJI/v8o18nCyATULDORLjpLi1zBRcIKJ0BPk4mc9I="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:37.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ] -> (known after apply)
      ~ source_code_hash               = "CyHUVfcBtKr3RWZ8BOjIM877h8LyTUB8o5x+n7VjaTI=" -> "d2Qzce6DGh43LKzrQ3GVu4PgkK8Ee+wwyf1k91GipS8="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2022-09-30T18:09:16.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ] -> (known after apply)
      ~ source_code_hash               = "d3iFPY4h4WLSKz1hdOoGt0hZCZIjrvw8h1CWA7WWn9Y=" -> "64NUO43zuqj7SHW9ARs2IAUrDiQJH2E3zyOE21OFrc8="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2022-09-30T18:09:36.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ] -> (known after apply)
      ~ source_code_hash               = "6TsivgwUC7Er2GPSzyAZ318rDwc5n7529opsxEDynRY=" -> "Bi0dI6L9wIl5dcdg1i+czwHUNaEU7ke89Unqkm3S7vs="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:58.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ] -> (known after apply)
      ~ source_code_hash               = "RL7QBzCLJ4bW/NuK9P4AiigfgoqAD3wXXLHiDqUxra8=" -> "zdFJLeMRMxhskXU4MdkYQw1k1mFZuOTsRsjqwLhXV88="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2022-09-30T18:09:36.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ] -> (known after apply)
      ~ source_code_hash               = "qBzSm5vmhbe88zOo3n8kY/fGkpMkIgqiNcw3a5vU9j8=" -> "8cRbHyLWur8Np439O+xWVtRakD7HZh8+gOmWDARwGxg="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "Ejl7GDJw9DF/0vlex+gfrRb/Vyp0yfVlEw2XrLaJmXA=" -> "4zjNLJoHEut3oit/wT9oeZNFlMhvuQhhjKQovN2Knmg="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2022-09-30T18:09:17.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ] -> (known after apply)
      ~ source_code_hash               = "hwKj55LvbBKyfGjE7UVRMEgWjRzbJ0rBWeW8uM2M4Hk=" -> "u+qPKZL/af2xrzM1u+b77TDeT32AIgeWOPUitqaRpqQ="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2022-09-30T18:09:17.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ] -> (known after apply)
      ~ source_code_hash               = "fmYq/0B8jfdegpydqAH90lDtxFt+Aw+7jweL48ClHdI=" -> "qkphToMDsSLbBIolOL/nmE7lSfo2wasTXqJJyPCXOB0="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:36.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ] -> (known after apply)
      ~ source_code_hash               = "RioVkOA9XP5et56zms7g8A23iuTDDiK39Uie6Sjuj9Q=" -> "5k6b4Fx0nRnNnv2DuPrSzf1Dg5s5Id1UEGJsQt3eq68="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-09-30T18:09:17.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ] -> (known after apply)
      ~ source_code_hash               = "Bnv7iUbr1K2H6DXOeB5lqO4LWys9irNSiOVOBC0DOpE=" -> "8z8gk1tSyEBrEhJh0Uv2cXX+clf/tTeIU/XCnnf+JeQ="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-09-30T18:09:36.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ] -> (known after apply)
      ~ source_code_hash               = "HS+0kI9AkoCVw/EjnRQngeoCeQEVZBNbFDjAr3HqO6E=" -> "7xvhLeGEHoartV5/D9pACPzKQKSLPTuyrbbnzuIGtxE="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:37.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ] -> (known after apply)
      ~ source_code_hash               = "0F3ULD3wPXNebcyyiSuZQkFnFm/yvOGOBTwF/if1b9U=" -> "308hEPnvmwdhngk3SSr3N84KURr5+jnH3JB2fYSJeac="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:57.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ] -> (known after apply)
      ~ source_code_hash               = "MXmbtJC/QhdYYNAjiCrxhTxb38FkSbRzh5i/A6+Rl1M=" -> "5XpH/JNfXnQaF6VXg29WqiLHD7oTAHOB4y5JSFZ+Nck="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2022-09-30T18:09:16.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ] -> (known after apply)
      ~ source_code_hash               = "+J0R7p9wnt/MFD5diNufPLuxHIQ2zub2chmmoXjgEcg=" -> "hVWvp6wnkZiAxSzIvGNBV7+2fnjXGiaoAQXtNvWjxi4="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2022-09-30T18:09:21.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ] -> (known after apply)
      ~ source_code_hash               = "0k1CRzS3J9MYzkAnMK2GfzK2JUUhOXTO/C1vQhIYCfA=" -> "+k+FC/NQ8BGVLdlkN75lbfNPL7zZzkbvxEzQGNfXkII="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:34.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ] -> (known after apply)
      ~ source_code_hash               = "yBeuHuFHVzw3XCc5Y34EpB8duxXhdu06a7D2W072vXU=" -> "9lD3m6ckiez02a7FCz/LkQeTXrUvbYzvBzGDV4KGupc="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:58.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ] -> (known after apply)
      ~ source_code_hash               = "sg6EKq0bxKqDJyIT2aob6+urS34CsqnKvZJg+SGF0IY=" -> "mUDdbrzgPfIACCsQWrTMfR1riEgSoIV1sKr86Yr8+T0="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2022-09-30T18:09:17.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ] -> (known after apply)
      ~ source_code_hash               = "NWzy/Wq5BR3P5OwcoUJoDqKsEq2lIJZkqtsXhyMvsJk=" -> "O80SjHNiAYPl6qW+JICuBXDFFouSTc4Vyokc9PaDiHU="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:58.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ] -> (known after apply)
      ~ source_code_hash               = "z6kOrmXCir5rdtmCCSCVeDUPeLkQ3fMemN3im+3naSQ=" -> "Tu7dECA+JerzJXUwRcWflaY8yf4fdTVjOia9bcoQr/Q="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2022-09-30T18:09:36.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ] -> (known after apply)
      ~ source_code_hash               = "MBrdeAJvwqgzo//jjIQ+E+gDprwbsEPgpro4+uBcv/4=" -> "OQltV8YmqeLa9kBtKo5edWr7fVPhbniRpKatqQs30GU="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-09-30T18:09:17.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ] -> (known after apply)
      ~ source_code_hash               = "PF8WAD8Vm3T+eCfT9YEtLXTeLp+tLGZAkR7BXB1bWn8=" -> "26gDv1e/H6i7vVLSDhjnwPmJ4xc39NN76651k5SFTms="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2022-09-30T18:09:15.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ] -> (known after apply)
      ~ source_code_hash               = "Y9/furq3Rf/najoGfE/silCYRFAJ0J/LxrtBC9kR3/k=" -> "rgFA01Om5DC20dJnbulomak1RrYc79C/m0MbxxOfFdM="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_year_options_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_year_options_lambda_function" {
        id                             = "demo_get_investment_year_options_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:57.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ] -> (known after apply)
      ~ source_code_hash               = "oTq2/u5VImFafUgdNN2Qrqkht87ArqDgZlY1DykUABs=" -> "yB4vZQTw+68dRbCWcTN4gxfkq2OF6Dtv4TFOKFpvRjY="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_year_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_year_report_lambda_function" {
        id                             = "demo_get_investment_year_report_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:55.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ] -> (known after apply)
      ~ source_code_hash               = "a7XkxkNErA7yU7Ii8ZeDRep0roBcyFnjOeO3V01HR/k=" -> "20Ctlthq9eIglofJhnrzOzUUdYK7OqJrMZuFJk2KlBA="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:36.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ] -> (known after apply)
      ~ source_code_hash               = "eUbzIiXDfIP5JcY4V628uhLOrowKwKvA9T3dpF+gpM4=" -> "LXRA9+HuDbn5CYGfTkiZ4UQCh4S7OuhD02GYDv1H1tM="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2022-09-30T18:09:35.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ] -> (known after apply)
      ~ source_code_hash               = "PWmtTI1Qqq/0ZlcsWaILF4Hv3n2FeYkix6jr6/Iqmjc=" -> "tMDYO7yKvnpFXSKmFuBs2btlF4m8e97vKvEjWQnWJ3I="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2022-09-30T18:09:38.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ] -> (known after apply)
      ~ source_code_hash               = "ZY2DN082UEqRvsEjDfIdQoLiirvWhx8wPjMlFJwOWTg=" -> "skG0H+Fhk2JKX6pFOk1wk70xHxSaphMzFQ0ZD5i253Y="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:59.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ] -> (known after apply)
      ~ source_code_hash               = "v+jBRSg4XnaLNAIFDHliNCTDtJ2/AwDg+qnzKYR4Crg=" -> "ON3du1AXbkJiY3EkH7mifQzZz3phI07spbP0nNQoaUc="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2022-09-30T18:09:38.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ] -> (known after apply)
      ~ source_code_hash               = "IYUxm/27gAbrRsbHaI89Bn9r2zUdlnBXQR4oNiqa5IQ=" -> "X5CFaT1rCwgDJ5Wzj+94tRxVmQoYrPeAB3KpmPY0CX0="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:35.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ] -> (known after apply)
      ~ source_code_hash               = "KIH+2uT8NVcShJIBJI7WJY159jB2AdWl9pptyE+hSKE=" -> "KTUaPHSYiSjUeZxbmFZNvtVl8DuRWM5W8W28/qkMhLA="
        tags                           = {}
        # (17 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:56.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ] -> (known after apply)
      ~ source_code_hash               = "A1erIge4EyF2DfxGslEcZxh4in/wGLBaULhzdEg8U+k=" -> "zjlRaIFJQrTg39JuTgbvI3DXYg96yxmWxw3It2eMRUM="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:56.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ] -> (known after apply)
      ~ source_code_hash               = "eIJWnn/LPSbZZ5Y7jzyIb0GMjYwhCziFkOPD4nawguI=" -> "34W6LxAzNPOOAF9KTWgm8GX6ObpO+xFtzzKyBHuGdT8="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:34.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ] -> (known after apply)
      ~ source_code_hash               = "m0fpac0hzJLcqMT4prIwQBfFMK0/z5EKfkLdZWG+xaU=" -> "ZPEYYcAsOm24RIgVZtC4JQetNxaK/3Rwza+ML8eWr2E="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:34.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ] -> (known after apply)
      ~ source_code_hash               = "RUYl1EAUoFYKT44aI6ECdKpXDpd+0hzQlFx7HpLphfk=" -> "lW7k/d1kAY6H7aIuaMdYQDY7fu7kC/N/JbPdUGjVGJg="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:34.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ] -> (known after apply)
      ~ source_code_hash               = "zQo+vubyBGFAQff/7KOzQziH4ftWhtMxazEyp/GVlgE=" -> "6qHkxCXq12EonUV+iJwoQPTexiZuKmdMS21ROFGIcL4="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:37.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ] -> (known after apply)
      ~ source_code_hash               = "CFmpo/JVhipKEZ4vC3znB7UtzYk7mnfQpf1BE4mdHTI=" -> "4xfniGtfC3zJGAv53KLxLJ0n7KAz5b/mGeLKAQQZqUA="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_layer_version.db_lambda_layer must be replaced
+/- resource "aws_lambda_layer_version" "db_lambda_layer" {
      ~ arn                         = "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22" -> (known after apply)
      ~ created_date                = "2022-09-30T18:08:23.861+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "5f/NLeI4BxWPcLJPF2+tmCR03Mx8AGADbqEzu7BU2cg=" -> "+gEEluOz+TEjlVZpdYZuUX9YvoA32IhgzvZC0+yCAvA=" # forces replacement
      ~ source_code_size            = 34939353 -> (known after apply)
      ~ version                     = "22" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2022-09-30T18:08:14Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "wdve7j" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2022-09-30T18:08:13Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2022-09-30T18:09:45Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 79 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @kellycastrof, Action: `pull_request`*